app/Filament/Resources/FooterSettingsResource/Pages/ManageFooterSettings.php

insert into "footer_settings" ("copyright_text", "updated_at", "created_at") values ('© 2025 Your Company Name. All rights reserved.', '2025-03-20 23:40:12', '2025-03-20 23:40:12')
select * from "footer_settings" limit 1
---
    public function getRecord(): Model
    {
        return FooterSettings::firstOrCreate(
            [],
            [
                'copyright_text' => '© ' . date('Y') . ' Your Company Name. All rights reserved.',
            ]
        );