app/Filament/Fabricator/PageBlocks/Gallery01.php

    public static function mutateData(array $data): array
    {
        $columns = $data['columns'] ?? [];

        foreach ($columns as &$column) {
            if (isset($column['images'])) {
                foreach ($column['images'] as &$image) {
                    if (isset($image['image'])) {
                        $mediaItem = Media::find($image['image']);
---
select * from "media" where "media"."id" = 2 limit 1