app/Filament/Widgets/ArticlesChart.php

select DATE(published_at) as day, COUNT(*) as count from "articles" where "is_published" = 1 group by "day" order by "day" asc
---
    protected function getData(): array
    {
        $trendData = Article::query()
            ->where('is_published', true)
            ->selectRaw('DATE(published_at) as day') // Use DATE() for SQLite
            ->selectRaw('COUNT(*) as count')
            ->groupBy('day')
            ->orderBy('day')
            ->pluck('count', 'day');