app/Filament/Widgets/KanbanStats.php

select count(*) as aggregate from "tasks" where "status" = 'done'
select count(*) as aggregate from "tasks" where "status" = 'in_progress'
---
    protected function getStats(): array
    {
        return [
            Stat::make('Total Tasks', Task::count())
                ->description('Total number of tasks')
                ->color('primary')
                ->icon('heroicon-o-document-text'),

            Stat::make('Completed Tasks', Task::where('status', 'done')->count())
                ->description('Tasks marked as done')
                ->color('success')
                ->icon('heroicon-o-check-circle'),

            Stat::make('In Progress', Task::where('status', 'in_progress')->count())
                ->description('Tasks currently being worked on')
                ->color('warning')
                ->icon('heroicon-o-clock'),